MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM4GQF20FG/mcu.h
/**
  * @brief ADC
  */
typedef struct
{
  __IO uint32_t CR0;               /*!< AD Control Register 0                        */
  __IO uint32_t CR1;               /*!< AD Control Register 1                        */
  __I  uint32_t ST;                /*!< AD Status Register                           */
  __IO uint32_t CLK;               /*!< AD Conversion Clock Setting Register         */
  __IO uint32_t MOD0;              /*!< AD Mode Setting Register 0                   */
  __IO uint32_t MOD1;              /*!< AD Mode Setting Register 1                   */
  __IO uint32_t MOD2;              /*!< AD Mode Setting Register 2                   */
       uint32_t RESERVED0;
  __IO uint32_t CMPEN;             /*!< Monitor function Enable Register             */
  __IO uint32_t CMPCR0;            /*!< AD Monitor function Setting Register 0       */
  __IO uint32_t CMPCR1;            /*!< AD Monitor function Setting Register 1       */
  __IO uint32_t CMP0;              /*!< AD Conversion Result Comparison Register 0   */
  __IO uint32_t CMP1;              /*!< AD Conversion Result Comparison Register 1   */
       uint32_t RESERVED1[34];
  __IO uint32_t EXAZSEL;           /*!< AD External AIN sampling period selection Register*/
  __IO uint32_t TSET0;             /*!< AD Start-up Factor Program Register 0        */
  __IO uint32_t TSET1;             /*!< AD Start-up Factor Program Register 1        */
  __IO uint32_t TSET2;             /*!< AD Start-up Factor Program Register 2        */
  __IO uint32_t TSET3;             /*!< AD Start-up Factor Program Register 3        */
  __IO uint32_t TSET4;             /*!< AD Start-up Factor Program Register 4        */
  __IO uint32_t TSET5;             /*!< AD Start-up Factor Program Register 5        */
  __IO uint32_t TSET6;             /*!< AD Start-up Factor Program Register 6        */
  __IO uint32_t TSET7;             /*!< AD Start-up Factor Program Register 7        */
  __IO uint32_t TSET8;             /*!< AD Start-up Factor Program Register 8        */
  __IO uint32_t TSET9;             /*!< AD Start-up Factor Program Register 9        */
  __IO uint32_t TSET10;            /*!< AD Start-up Factor Program Register 10       */
  __IO uint32_t TSET11;            /*!< AD Start-up Factor Program Register 11       */
  __IO uint32_t TSET12;            /*!< AD Start-up Factor Program Register 12       */
  __IO uint32_t TSET13;            /*!< AD Start-up Factor Program Register 13       */
  __IO uint32_t TSET14;            /*!< AD Start-up Factor Program Register 14       */
  __IO uint32_t TSET15;            /*!< AD Start-up Factor Program Register 15       */
  __IO uint32_t TSET16;            /*!< AD Start-up Factor Program Register 16       */
  __IO uint32_t TSET17;            /*!< AD Start-up Factor Program Register 17       */
  __IO uint32_t TSET18;            /*!< AD Start-up Factor Program Register 18       */
  __IO uint32_t TSET19;            /*!< AD Start-up Factor Program Register 19       */
  __IO uint32_t TSET20;            /*!< AD Start-up Factor Program Register 20       */
  __IO uint32_t TSET21;            /*!< AD Start-up Factor Program Register 21       */
  __IO uint32_t TSET22;            /*!< AD Start-up Factor Program Register 22       */
  __IO uint32_t TSET23;            /*!< AD Start-up Factor Program Register 23       */
       uint32_t RESERVED2[8];
  __I  uint32_t REG0;              /*!< AD Conversion Result Storage Register 0      */
  __I  uint32_t REG1;              /*!< AD Conversion Result Storage Register 1      */
  __I  uint32_t REG2;              /*!< AD Conversion Result Storage Register 2      */
  __I  uint32_t REG3;              /*!< AD Conversion Result Storage Register 3      */
  __I  uint32_t REG4;              /*!< AD Conversion Result Storage Register 4      */
  __I  uint32_t REG5;              /*!< AD Conversion Result Storage Register 5      */
  __I  uint32_t REG6;              /*!< AD Conversion Result Storage Register 6      */
  __I  uint32_t REG7;              /*!< AD Conversion Result Storage Register 7      */
  __I  uint32_t REG8;              /*!< AD Conversion Result Storage Register 8      */
  __I  uint32_t REG9;              /*!< AD Conversion Result Storage Register 9      */
  __I  uint32_t REG10;             /*!< AD Conversion Result Storage Register 10     */
  __I  uint32_t REG11;             /*!< AD Conversion Result Storage Register 11     */
  __I  uint32_t REG12;             /*!< AD Conversion Result Storage Register 12     */
  __I  uint32_t REG13;             /*!< AD Conversion Result Storage Register 13     */
  __I  uint32_t REG14;             /*!< AD Conversion Result Storage Register 14     */
  __I  uint32_t REG15;             /*!< AD Conversion Result Storage Register 15     */
  __I  uint32_t REG16;             /*!< AD Conversion Result Storage Register 16     */
  __I  uint32_t REG17;             /*!< AD Conversion Result Storage Register 17     */
  __I  uint32_t REG18;             /*!< AD Conversion Result Storage Register 18     */
  __I  uint32_t REG19;             /*!< AD Conversion Result Storage Register 19     */
  __I  uint32_t REG20;             /*!< AD Conversion Result Storage Register 20     */
  __I  uint32_t REG21;             /*!< AD Conversion Result Storage Register 21     */
  __I  uint32_t REG22;             /*!< AD Conversion Result Storage Register 22     */
  __I  uint32_t REG23;             /*!< AD Conversion Result Storage Register 23     */
} TSB_AD_TypeDef;

/**
  * @brief Digital analog converter (DAC)
  */
typedef struct
{
  __IO uint32_t CR;                /*!< DAC Control Register                         */
  __IO uint32_t REG;               /*!< DAC Converted Value Setting Register         */
} TSB_DA_TypeDef;

/**
  * @brief 16-bit Timer/Event Counter (TB)
  */
typedef struct
{
  __IO uint32_t MOD;               /*!< T32A Mode Register                           */
       uint32_t RESERVED0[15];
  __IO uint32_t RUNA;              /*!< T32A Run Register A                          */
  __IO uint32_t CRA;               /*!< T32A Counter Control Register A              */
  __IO uint32_t CAPCRA;            /*!< T32A Capture Control Register A              */
  __O  uint32_t OUTCRA0;           /*!< T32A Output Control Register A0              */
  __IO uint32_t OUTCRA1;           /*!< T32A Output Control Register A1              */
  __IO uint32_t STA;               /*!< T32A Status Register A                       */
  __IO uint32_t IMA;               /*!< T32A Interrupt Mask Register A               */
  __I  uint32_t TMRA;              /*!< T32A Counter Capture Register A              */
  __IO uint32_t RELDA;             /*!< T32A Counter Reload Register A               */
  __IO uint32_t RGA0;              /*!< T32A Timer Register A0                       */
  __IO uint32_t RGA1;              /*!< T32A Timer Register A1                       */
  __I  uint32_t CAPA0;             /*!< T32A Timer Capture A0 Register               */
  __I  uint32_t CAPA1;             /*!< T32A Timer Cupture A1 Register               */
  __IO uint32_t DMAA;              /*!< T32A DMA Request Enable Register A           */
       uint32_t RESERVED1[2];
  __IO uint32_t RUNB;              /*!< T32A Run Register B                          */
  __IO uint32_t CRB;               /*!< T32A Counter Control Register B              */
  __IO uint32_t CAPCRB;            /*!< T32A Capture Control Register B              */
  __O  uint32_t OUTCRB0;           /*!< T32A Output Control Register B0              */
  __IO uint32_t OUTCRB1;           /*!< T32A Output Control Register B1              */
  __IO uint32_t STB;               /*!< T32A Status Register B                       */
  __IO uint32_t IMB;               /*!< T32A Interrupt Mask Register B               */
  __I  uint32_t TMRB;              /*!< T32A Counter Capture Register B              */
  __IO uint32_t RELDB;             /*!< T32A Counter Reload Register B               */
  __IO uint32_t RGB0;              /*!< T32A Timer Register B0                       */
  __IO uint32_t RGB1;              /*!< T32A Timer Register B1                       */
  __I  uint32_t CAPB0;             /*!< T32A Timer Capture B0 Register               */
  __I  uint32_t CAPB1;             /*!< T32A Timer Capture B1 Register               */
  __IO uint32_t DMAB;              /*!< T32A DMA Request Enable Register B           */
       uint32_t RESERVED2[2];
  __IO uint32_t RUNC;              /*!< T32A Run Register C                          */
  __IO uint32_t CRC;               /*!< T32A Counter Control Register C              */
  __IO uint32_t CAPCRC;            /*!< T32A Capture Control Register C              */
  __O  uint32_t OUTCRC0;           /*!< T32A Output Control Register C0              */
  __IO uint32_t OUTCRC1;           /*!< T32A Output Control Register C1              */
  __IO uint32_t STC;               /*!< T32A Status Register C                       */
  __IO uint32_t IMC;               /*!< T32A Interrupt Mask Register C               */
  __I  uint32_t TMRC;              /*!< T32A Counter Capture Register C              */
  __IO uint32_t RELDC;             /*!< T32A Counter Reload Register C               */
  __IO uint32_t RGC0;              /*!< T32A Timer Register C0                       */
  __IO uint32_t RGC1;              /*!< T32A Timer Register C1                       */
  __I  uint32_t CAPC0;             /*!< T32A Timer Capture C0 Register               */
  __I  uint32_t CAPC1;             /*!< T32A Capture Register C1                     */
  __IO uint32_t DMAC;              /*!< T32A DMA Request Enable Register C           */
  __IO uint32_t PLSCR;             /*!< T32A Pulse Count Control Register            */
} TSB_T32A_TypeDef;

/**
  * @brief TSSI
  */
typedef struct
{
  __IO uint32_t CR0;               /*!< TSSI Control Register 0                      */
  __IO uint32_t CR1;               /*!< TSSI Control Register 1                      */
       uint32_t RESERVED0[2];
  __IO uint32_t CPR;               /*!< TSSI Clock Divider Register                  */
       uint32_t RESERVED1[11];
  __IO uint32_t RCMR;              /*!< TSSI Receive Clock / Mode Control Register   */
  __IO uint32_t RFMR;              /*!< TSSI Receive Data Frame Control Register     */
  __IO uint32_t RCR;               /*!< TSSI Receive Data Comparison Register        */
  __IO uint32_t RDMACR;            /*!< TSSI Receive DMA Control Register            */
       uint32_t RESERVED2[4];
  __IO uint32_t RSR;               /*!< TSSI Reception Status Register               */
  __IO uint32_t RIER;              /*!< TSSI Receive Interrupt Enable Register       */
       uint32_t RESERVED3[2];
  __IO uint32_t RFTLR;             /*!< TSSI Receive FIFO Threshold Register         */
  __I  uint32_t RFLR;              /*!< TSSI Receive FIFO Entry Register             */
       uint32_t RESERVED4[2];
  __I  uint32_t RDR0;              /*!< TSSI Receive Data Register 0                 */
  __I  uint32_t RDR1;              /*!< TSSI Receive Data Register 1                 */
  __I  uint32_t RDR2;              /*!< TSSI Receive Data Register 2                 */
  __I  uint32_t RDR3;              /*!< TSSI Receive Data Register 3                 */
       uint32_t RESERVED5[4];
  __IO uint32_t TCMR;              /*!< TSSI Transmit Clock / Mode Control Register  */
  __IO uint32_t TFMR;              /*!< TSSI Transmit Data Frame Control Register    */
       uint32_t RESERVED6;
  __IO uint32_t TDMACR;            /*!< TSSI Transmit DMA Control Register           */
       uint32_t RESERVED7[4];
  __IO uint32_t TSR;               /*!< TSSI Transmission Status Register            */
  __IO uint32_t TIER;              /*!< TSSI Transmission Interrupt Enable Register  */
       uint32_t RESERVED8[2];
  __IO uint32_t TFTLR;             /*!< TSSI Transmit FIFO Threshold Register        */
  __I  uint32_t TFLR;              /*!< TSSI Transmit FIFO Entry Register            */
       uint32_t RESERVED9[2];
  __O  uint32_t TDR0;              /*!< TSSI Transmission Data Register 0            */
  __O  uint32_t TDR1;              /*!< TSSI Transmission Data Register 1            */
  __O  uint32_t TDR2;              /*!< TSSI Transmission Data Register 2            */
  __O  uint32_t TDR3;              /*!< TSSI Transmission Data Register 3            */
} TSB_TSSI_TypeDef;

/**
  * @brief UART
  */
typedef struct
{
  __IO uint32_t SWRST;             /*!< UART Software Reset Register                 */
  __IO uint32_t CR0;               /*!< UART Control Register 0                      */
  __IO uint32_t CR1;               /*!< UART Control Register 1                      */
  __IO uint32_t CLK;               /*!< UART Clock Control Register                  */
  __IO uint32_t BRD;               /*!< UART Baud Rate Register                      */
  __IO uint32_t TRANS;             /*!< UART Transfer Enable Register                */
  __IO uint32_t DR;                /*!< UART Data Register                           */
  __IO uint32_t SR;                /*!< UART Status Register                         */
  __O  uint32_t FIFOCLR;           /*!< UART FIFO Clear Register                     */
  __IO uint32_t ERR;               /*!< UART Error Register                          */
} TSB_UART_TypeDef;

